"""
桶排序（动态桶 + 索引映射版本）

重要步骤：索引映射

建桶的三种方案：
1.列表推导式批量建桶（最常用）（本代码中使用此方法）
2.字典/哈希表建桶（适合稀疏数据或未知范围）
3.原地分区 + 偏移量数组（工业级/极致性能）

step1:确定数据范围和桶的大小
step2:把数组分到对应的桶里
step3:对每个非空的桶内部排序（可以用任意排序算法）
step4:按桶的顺序合并

桶大小的选择直接影响性能和空间消耗：
太大：每个桶里数据多，会导致桶内排序慢
太小：桶的数量多，浪费空间

极端情形下的适应性：
数据分布不均匀情形下：可能退化，因为大部分数据挤在同一个桶里面
数据范围很大的情形下：可能浪费，因为需要很多桶

桶内排序算法的选择会决定桶内排序的速度
Timsort排序：适合 部分有序 内存充足 需要稳定性 的情形 ， 不适合 完全随机 链表 内存紧张 需要严格稳定响应时间 的情形
"""

from bubble_sort import random_arr

def bucket_sort(arr):
    """
    桶排序

    时间复杂度：
    分桶：O(N) - 遍历每个元素，找到它属于哪个桶
    桶内排序：O(NlogN)或O(N^2)（最坏情况）-取决于桶内元素数量和使用的排序算法 本代码中用 Timsort 排序，其最坏情况是O(NlogN)
    合并:O(N) - 按桶顺序依次取出所有元素

    最好情况下，桶排序可能达到O(N)（例如每个桶平均一个元素）,最坏情况下则是O(N^2)
    
    Args:
        arr:待排序数组
    Returns:
        None:仅原地修改待排序数组至正确顺序
    """
    if not arr:
        return # arr[:] 效果上等同于 arr.copy(), 都是创建浅拷贝避免污染 - 优化：由于最终结果改成原地修改，这里也统一只返回 None

    # 1. 确认数据范围
    max_val = max(arr)
    min_val = min(arr) # 直接调用内部库求出数据范围而不依赖输入

    if min_val == max_val:
        return

    # 2. 确认桶数量，批量建桶
    bucket_num = len(arr) # 桶数量通常取 原数组尺寸 n ，使每个桶期望元素数为 O(1) 这是理论最优默认值
    range_size = max_val - min_val
    buckets = [[] for _ in range(bucket_num)] # 列表推导式写法批量建桶（列表中的所有列表元素会分配到不同的内存地址） 相当于建立一个元素全为独立空列表的列表

    # 绝对禁止的写法：buckets_bad = [[]] * 5 
    # 原因: * 运算符对可变对象执行浅拷贝(引用复制)，所有桶指向同一内存对象
    # 后果: buckets[0].append(5) → 所有桶同时变为 [5]，数据严重污染
    # 替代: 必须使用列表推导式或显式 for 循环逐个创建

    # 3. 遍历列表元素放入对应桶中
    for num in arr: # 直接对列表元素进行遍历
       # 核心步骤 ： 索引映射 = 归零平移 - 归一化（得到一个比例值，表示当前元素在整个数据范围中的相对位置） - 缩放到桶空间 - 离散化取整（int向下截断）
       # 重点: 1. 使用浮点除法获取精准比例； 2. 缩放时候注意 bucket_num - 1 操作以获取正确不越界的索引
       idx = min(int((num - min_val) / range_size * (bucket_num - 1)),bucket_num - 1) # min 操作是在做防御性编程，杜绝因浮点误差带来的越界 
       buckets[idx].append(num)

    # 4. 对每个独立桶进行桶内排序
    result_arr = []
    for bucket in buckets:
        bucket.sort() # 桶内使用 Timsort，小数组效率极高
        result_arr.extend(bucket) # 注意这里要使用.extend()而非.append()

    # for i in range(len(result_arr)):
        # arr[i] = result_arr[i]

    # 赋值优化：使用切片赋值直接修改原数组
    arr[:] = result_arr

    # 切片操作会随位置不同产生意义的重大区别!!!
    # arr[:] 在右边 → 读 → 产生副本
    # arr[:] = 在左边 → 写 → 原地替换（不会先建立新副本而是直接逐元素替换）

    # arr[:] = rhs 中的 [:] 代表的是整个列表的范围切片，它的语义是：
    # “将左侧列表中该切片所覆盖的区域，整体替换为右侧可迭代对象的所有元素”。
    # 当 len(rhs) == len(arr) 时（如本代码），CPython 会优化为逐位置覆盖写入，复用原内存块；
    # 当长度不等时，才退化为 删除 + 插入 的组合操作。
    # 无论哪种情况，arr 的对象 id 不变，外部引用不会失效。

if __name__ == '__main__':
    arr = random_arr(100,0,100)
    print("待桶排序数组:",arr)
    bucket_sort(arr)
    print("桶排序后数组:",arr)